# Module 3 Pandas

In [2]:
import pandas as pd

In [62]:
df = pd.read_csv('data.csv')

In [63]:
df

      Name  Height Gender
0     Ally     160      F
1  Belinda     154      F
2   Alfred     170      M
3     Jane     145      F
4    Steve     180      M

In [4]:
!pip3 install xlrd

Requirement already satisfied: xlrd in /Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages (1.1.0)

In [5]:
df = pd.read_excel('data.xlsx')

In [5]:
df

      Name  Height Gender
0     Ally     160      F
1  Belinda     154      F
2   Alfred     170      M
3     Jane     145      F
4    Steve     180      M

In [15]:
df[(df.Gender == 'F') & (df.Height>150)]

      Name  Height Gender
0     Ally     160      F
1  Belinda     154      F

In [28]:
df.loc[1]

Name      Belinda
Height        154
Gender          F
Name: 1, dtype: object

In [29]:
df.iloc[1]

Name      Belinda
Height        154
Gender          F
Name: 1, dtype: object

In [21]:
df['Name']

0       Ally
1    Belinda
2     Alfred
3       Jane
4      Steve
Name: Name, dtype: object

In [25]:
df.Name

0       Ally
1    Belinda
2     Alfred
3       Jane
4      Steve
Name: Name, dtype: object

In [23]:
df[['Name']]

      Name
0     Ally
1  Belinda
2   Alfred
3     Jane
4    Steve

In [7]:
df.shape

(5, 3)

In [8]:
df.columns

Index(['Name', 'Height', 'Gender'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df.values

array([['Ally', 160, 'F'],
       ['Belinda', 154, 'F'],
       ['Alfred', 170, 'M'],
       ['Jane', 145, 'F'],
       ['Steve', 180, 'M']], dtype=object)

In [52]:
df2 = pd.read_csv('mtcars.csv',index_col='car_names')

In [53]:
df2.head(10)

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
car_names,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4

In [59]:
df2[['mpg','cyl']]

                      mpg  cyl
car_names
Mazda RX4            21.0    6
Mazda RX4 Wag        21.0    6
Datsun 710           22.8    4
Hornet 4 Drive       21.4    6
Hornet Sportabout    18.7    8
Valiant              18.1    6
Duster 360           14.3    8
Merc 240D            24.4    4
Merc 230             22.8    4
Merc 280             19.2    6
Merc 280C            17.8    6
Merc 450SE           16.4    8
Merc 450SL           17.3    8
Merc 450SLC          15.2    8
Cadillac Fleetwood   10.4    8
Lincoln Continental  10.4    8
Chrysler Imperial    14.7    8
Fiat 128             32.4    4
Honda Civic          30.4    4
Toyota Corolla       33.9    4
Toyota Corona        21.5    4
Dodge Challenger     15.5    8
AMC Javelin          15.2    8
Camaro Z28           13.3    8
Pontiac Firebird     19.2    8
Fiat X1-9            27.3    4
Porsche 914-2        26.0    4
Lotus Europa         30.4    4
Ford Pantera L       15.8    8
Ferrari Dino         19.7    6
Maserati Bora        15.0    8
Volvo 142E           21.4    4

In [60]:
df6 = df2.drop(['am','gear'],axis=1).drop(['Merc 230','Ferrari Dino'],axis=0)

In [61]:
df6.to_csv('data4.csv')

In [30]:
df2.loc[['Honda Civic','Porsche 914-2']]

                mpg  cyl  hp
car_names
Honda Civic    30.4    4  52
Porsche 914-2  26.0    4  91

In [17]:
df3 = pd.read_csv('data2.csv')

In [18]:
df3

      Name  Height Gender
0     Ally   160.0      F
1  Belinda   154.0    NaN
2   Alfred     NaN      M
3     Jane   145.0      F
4    Steve   180.0      M

In [19]:
df3.isnull()

    Name  Height  Gender
0  False   False   False
1  False   False    True
2  False    True   False
3  False   False   False
4  False   False   False

In [21]:
df3.isnull().sum()

Name      0
Height    1
Gender    1
dtype: int64

In [39]:
df3.fillna({'Gender':'F'}).fillna(df3.mean())

      Name  Height Gender
0     Ally  160.00      F
1  Belinda  154.00      F
2   Alfred  159.75      M
3     Jane  145.00      F
4    Steve  180.00      M

In [40]:
df3

      Name  Height Gender
0     Ally   160.0      F
1  Belinda   154.0    NaN
2   Alfred     NaN      M
3     Jane   145.0      F
4    Steve   180.0      M

In [41]:
df3.dropna()

    Name  Height Gender
0   Ally   160.0      F
3   Jane   145.0      F
4  Steve   180.0      M

In [43]:
df4=pd.read_csv('data3.csv')
df4

      Name  Height Gender
0     Ally   160.0      F
1     Ally   160.0      F
2  Belinda   154.0    NaN
3   Alfred     NaN      M
4     Jane   145.0      F
5     Jane   145.0      F
6    Steve   180.0      M

In [44]:
df4.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [47]:
df5 = df4.drop_duplicates().dropna()

In [48]:
df5

    Name  Height Gender
0   Ally   160.0      F
4   Jane   145.0      F
6  Steve   180.0      M

In [50]:
df5.to_csv('data_cleaned.csv',index=False)